Mallas/M2/constant/polyMesh/boundary
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class polyBoundaryMesh;
 location "constant/polyMesh";
 object boundary;
}

(
  FrontAndBack

  {
    type empty;
    physicalType patch;
    nFaces 76820;
    startFace 64521;

  }
  patch1

  {
    type wall;
    physicalType patch;
    nFaces 98;
    startFace 141341;

  }
  patch2

  {
    type wall;
    physicalType patch;
    nFaces 98;
    startFace 141439;

  }
  patch3

  {
    type wall;
    physicalType patch;
    nFaces 98;
    startFace 141537;

  }
  Shaft

  {
    type wall;
    physicalType patch;
    nFaces 18;
    startFace 141635;

  }
  Inlet

  {
    type patch;
    physicalType patch;
    nFaces 34;
    startFace 141653;

  }
  Lat-Wall

  {
    type wall;
    physicalType patch;
    nFaces 68;
    startFace 141687;

  }
  Outlet

  {
    type patch;
    physicalType patch;
    nFaces 34;
    startFace 141755;

  }
  AMI-St

  {
    type cyclicAMI;
neighbourPatch AMI-Rt;
 matchTolerance 1e-4; 
 transform noOrdering;
    physicalType patch;
    nFaces 154;
    startFace 141789;

  }
  AMI-Rt

  {
    type cyclicAMI;
neighbourPatch AMI-St;
 matchTolerance 1e-4; 
 transform noOrdering;
    physicalType patch;
    nFaces 154;
    startFace 141943;

  }
)


// ************************************************************************* //